Tekla Open API Reference for Tekla Structures 2025
ExtensionIntersectsWithPlateException Fields
The ExtensionIntersectsWithPlateException type exposes the following members.
Fields
Name | Description
OperationStatus
 Possible error statuses for geometry creation/modification commands.
 (Inherited from ConnectiveGeometryException.)
Top
See Also
Reference
ExtensionIntersectsWithPlateException Class
Tekla.Structures.Model Namespace